nxp-mcuxpresso/mcux-soc-svd/MCXC151/MCXC151.xml
        <register>
          <name>FlexPWM0_FAULT2</name>
          <description>eFlexPWM0 FAULT2 Input Trigger Connection</description>
          <addressOffset>0x3C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIGIN</name>
              <description>Input Trigger Connection for eFlexPWM0 FAULT2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val1</name>
                  <description>ARM_TXEV input is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>CMP0_OUT input is selected</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>CTimer0_MAT2 input is selected</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10</name>
                  <description>CTimer0_MAT3 input is selected</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val11</name>
                  <description>CTimer1_MAT2 input is selected</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val12</name>
                  <description>CTimer1_MAT3 input is selected</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val20</name>
                  <description>TRIG_IN0 input is selected</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val21</name>
                  <description>TRIG_IN1 input is selected</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22</name>
                  <description>TRIG_IN2 input is selected</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val23</name>
                  <description>TRIG_IN3 input is selected</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val24</name>
                  <description>TRIG_IN4 input is selected</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val25</name>
                  <description>TRIG_IN5 input is selected</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val26</name>
                  <description>TRIG_IN6 input is selected</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val27</name>
                  <description>TRIG_IN7 input is selected</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val28</name>
                  <description>TRIG_IN8 input is selected</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val29</name>
                  <description>TRIG_IN9 input is selected</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val30</name>
                  <description>TRIG_IN10 input is selected</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val31</name>
                  <description>TRIG_IN11 input is selected</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val32</name>
                  <description>GPIO0 Pin Event Trig 0 input is selected</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val33</name>
                  <description>GPIO1 Pin Event Trig 0 input is selected</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val34</name>
                  <description>GPIO2 Pin Event Trig 0 input is selected</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val35</name>
                  <description>GPIO3 Pin Event Trig 0 input is selected</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val37</name>
                  <description>ECC Error Interrupt input is selected</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val38</name>
                  <description>WWDT0/1 Interrupt input is selected</description>
                  <value>0x26</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FlexPWM0_FAULT3</name>
          <description>eFlexPWM0 FAULT3 Input Trigger Connection</description>
          <addressOffset>0x3CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIGIN</name>
              <description>Input Trigger Connection for eFlexPWM0 FAULT3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val1</name>
                  <description>ARM_TXEV input is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>CMP0_OUT input is selected</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>CTimer0_MAT2 input is selected</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10</name>
                  <description>CTimer0_MAT3 input is selected</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val11</name>
                  <description>CTimer1_MAT2 input is selected</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val12</name>
                  <description>CTimer1_MAT3 input is selected</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val20</name>
                  <description>TRIG_IN0 input is selected</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val21</name>
                  <description>TRIG_IN1 input is selected</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22</name>
                  <description>TRIG_IN2 input is selected</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val23</name>
                  <description>TRIG_IN3 input is selected</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val24</name>
                  <description>TRIG_IN4 input is selected</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val25</name>
                  <description>TRIG_IN5 input is selected</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val26</name>
                  <description>TRIG_IN6 input is selected</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val27</name>
                  <description>TRIG_IN7 input is selected</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val28</name>
                  <description>TRIG_IN8 input is selected</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val29</name>
                  <description>TRIG_IN9 input is selected</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val30</name>
                  <description>TRIG_IN10 input is selected</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val31</name>
                  <description>TRIG_IN11 input is selected</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val32</name>
                  <description>GPIO0 Pin Event Trig 0 input is selected</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val33</name>
                  <description>GPIO1 Pin Event Trig 0 input is selected</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val34</name>
                  <description>GPIO2 Pin Event Trig 0 input is selected</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val35</name>
                  <description>GPIO3 Pin Event Trig 0 input is selected</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val37</name>
                  <description>ECC Error Interrupt input is selected</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val38</name>
                  <description>WWDT0/1 Interrupt input is selected</description>
                  <value>0x26</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FlexPWM0_FORCE</name>
          <description>eFlexPWM0 EXT_FORCE Input Trigger Connection</description>
          <addressOffset>0x3D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIGIN</name>
              <description>Input Trigger Connection for eFlexPWM0 EXT_FORCE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val1</name>
                  <description>ARM_TXEV input is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>CMP0_OUT input is selected</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>CTimer0_MAT2 input is selected</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10</name>
                  <description>CTimer0_MAT3 input is selected</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val11</name>
                  <description>CTimer1_MAT2 input is selected</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val12</name>
                  <description>CTimer1_MAT3 input is selected</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val20</name>
                  <description>TRIG_IN0 input is selected</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val21</name>
                  <description>TRIG_IN1 input is selected</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22</name>
                  <description>TRIG_IN2 input is selected</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val23</name>
                  <description>TRIG_IN3 input is selected</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val24</name>
                  <description>TRIG_IN4 input is selected</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val25</name>
                  <description>TRIG_IN5 input is selected</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val26</name>
                  <description>TRIG_IN6 input is selected</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val27</name>
                  <description>TRIG_IN7 input is selected</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val28</name>
                  <description>TRIG_IN8 input is selected</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val29</name>
                  <description>TRIG_IN9 input is selected</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val30</name>
                  <description>TRIG_IN10 input is selected</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val31</name>
                  <description>TRIG_IN11 input is selected</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val32</name>
                  <description>GPIO0 Pin Event Trig 0 input is selected</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val33</name>
                  <description>GPIO1 Pin Event Trig 0 input is selected</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val34</name>
                  <description>GPIO2 Pin Event Trig 0 input is selected</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val35</name>
                  <description>GPIO3 Pin Event Trig 0 input is selected</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val37</name>
                  <description>ECC Error Interrupt input is selected</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val38</name>
                  <description>WWDT0/1 Interrupt input is selected</description>
                  <value>0x26</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM0_EXT_CLK</name>
          <description>eFlexPWM0 EXT_CLK Trigger</description>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INP</name>
              <description>Input Trigger Connection for eFlexPWM0 EXT_CLK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val1</name>
                  <description>clk_16k[1] input is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>clk_in input is selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val5</name>
                  <description>TRIG_IN0 input is selected</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>TRIG_IN7 input is selected</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT_TRIG0</name>
          <description>External Trigger a Connections</description>
          <addressOffset>0x4C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INP</name>
              <description>External Trigger Input Connections</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val6</name>
                  <description>CMP0_OUT input is selected</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>LPUART0 ipp_do_lpuart_txd input is selected</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10</name>
                  <description>LPUART1 ipp_do_lpuart_txd input is selected</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val11</name>
                  <description>LPUART2 ipp_do_lpuart_txd input is selected</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val12</name>
                  <description>LPUART3 ipp_do_lpuart_txd input is selected</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val19</name>
                  <description>RTC_1Hz_CLK input is selected</description>
                  <value>0x13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT_TRIG1</name>
          <description>External Trigger a Connections</description>
          <addressOffset>0x4C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INP</name>
              <description>External Trigger Input Connections</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val6</name>
                  <description>CMP0_OUT input is selected</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>LPUART0 ipp_do_lpuart_txd input is selected</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10</name>
                  <description>LPUART1 ipp_do_lpuart_txd input is selected</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val11</name>
                  <description>LPUART2 ipp_do_lpuart_txd input is selected</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val12</name>
                  <description>LPUART3 ipp_do_lpuart_txd input is selected</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val19</name>
                  <description>RTC_1Hz_CLK input is selected</description>
                  <value>0x13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
