nxp-mcuxpresso/mcux-soc-svd/MCXC151/MCXC151.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>NVIC</name>
      <description>Nested Vectored Interrupt Controller</description>
      <groupName>NVIC</groupName>
      <baseAddress>0xE000E100</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE04</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>OR</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>CMC</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>DMA_CH0</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>DMA_CH1</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>DMA_CH2</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>DMA_CH3</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>ERM0_SINGLE_BIT</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>ERM0_MULTI_BIT</name>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>FMU0</name>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>MBC0</name>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>SCG0</name>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>SPC0</name>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>TRNG0</name>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>WUU0</name>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>LPI2C0</name>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>LPSPI0</name>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>LPUART0</name>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>LPUART1</name>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>LPUART2</name>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>Reserved50</name>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>Reserved51</name>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>CTIMER0</name>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>CTIMER1</name>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_RELOAD_ERROR</name>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_FAULT</name>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_SUBMODULE0</name>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_SUBMODULE1</name>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_SUBMODULE2</name>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>Reserved66</name>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>Reserved67</name>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>Reserved68</name>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>Reserved69</name>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>FREQME0</name>
        <value>54</value>
      </interrupt>
      <interrupt>
        <name>LPTMR0</name>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>VBAT0</name>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>RTC</name>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>RTC_1HZ</name>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>WWDT0</name>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>WWDT1</name>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>ADC0</name>
        <value>62</value>
      </interrupt>
      <interrupt>
        <name>CMP0</name>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>GPIO0</name>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>GPIO1</name>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>GPIO2</name>
        <value>73</value>
      </interrupt>
      <interrupt>
        <name>GPIO3</name>
        <value>74</value>
      </interrupt>
      <registers>
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>ISER[%s]</name>
          <description>Interrupt Set Enable Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA0</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA1</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA2</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA3</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA4</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA5</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA6</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA7</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA8</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA9</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA10</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA11</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA12</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA13</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA14</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA15</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA16</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA17</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA18</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA19</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA20</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA21</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA22</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA23</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
